import pygame

class Drawing():
	""" Класс для работы с графикой	"""

	def __init__(self):
		"""  Создание окна, инициализация объекта класса pygame, 
		название окна, стиль текста, размер пикселей/ботов  """
		pass

	def clear_pos_bot(self):
		""" Очищаем место где был бот раньше на экране """
		pass

	def clear_text(self):
		""" Закрашиваем чёрным место, где отрисовывается текст"""
		pass

	def draw_num_th(self):
		""" Рисуем количество активных потоков """
		pass

	def update_screen(self):
		""" Отрисовка всех объектов на экране"""
		pass

	def set_speed(self):
		""" Установить скорость обновления экрана"""
		pass